Билет8/AccumulationRegisters/Бюджет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<AccumulationRegister>
		<Properties>
			<Name>Бюджет</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопустимоеПревышение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Билет8/CommonModules/ОперУчет/Ext/Module.bsl
Процедура ПроведениеДокументаПоБюджету(Подразделение, СтатьяЗатрат, СуммаПоДокументу, Дата, Движения) Экспорт
	
	Движения.Бюджет.Записывать = Истина;
	Движение = Движения.Бюджет.Добавить();
	Движение.Период = Дата;
	Движение.Подразделение = Подразделение;
	Движение.СтатьяЗатрат = СтатьяЗатрат;
	Движение.СуммаФакт = СуммаПоДокументу;
	
	Движения.Бюджет.БлокироватьДляИзменения = Истина;
	Движения.Бюджет.Записать();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БюджетОбороты.СуммаПланОборот КАК СуммаПланОборот,
		|	БюджетОбороты.ДопустимоеПревышениеОборот КАК ДопустимоеПревышениеОборот,
		|	БюджетОбороты.СуммаФактОборот КАК СуммаФактОборот
		|ИЗ
		|	РегистрНакопления.Бюджет.Обороты(
		|			&НачалоМесяца,
		|			&КонецМесяца,
		|			,
		|			Подразделение = &Подразделение
		|				И СтатьяЗатрат = &СтатьяЗатрат) КАК БюджетОбороты";
	
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("СтатьяЗатрат", СтатьяЗатрат);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НеХватает = Выборка.СуммаФактОборот - Выборка.СуммаПланОборот;
		Если НеХватает > 0 Тогда
			
			НеХватаетСдопуском = Выборка.СуммаФактОборот - (Выборка.СуммаПланОборот + Выборка.ДопустимоеПревышениеОборот);
			Если НеХватаетСдопуском > 0 Тогда
				ТекстСообщения = СтрШаблон("Первышен бюджет (план + допуск) на %1", НеХватаетСдопуском);
			Иначе
				ТекстСообщения = СтрШаблон("Первышен бюджет (план) на %1", НеХватает);
			КонецЕсли;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстСообщения;
			Сообщение.Сообщить();
			
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры
